
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 96, 96, 6)    0                                            
__________________________________________________________________________________________________
zero_padding2d_47 (ZeroPadding2 (None, 102, 102, 6)  0           input_3[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 48, 48, 64)   18880       zero_padding2d_47[0][0]          
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 48, 48, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_75 (Activation)      (None, 48, 48, 64)   0           bn1[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_48 (ZeroPadding2 (None, 50, 50, 64)   0           activation_75[0][0]              
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 24, 24, 64)   0           zero_padding2d_48[0][0]          
__________________________________________________________________________________________________
lrn_1 (Lambda)                  (None, 24, 24, 64)   0           max_pooling2d_13[0][0]          
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 24, 24, 64)   4160        lrn_1[0][0]                    
__________________________________________________________________________________________________
bn2 (BatchNormalization)        (None, 24, 24, 64)   256         conv2[0][0]                     
__________________________________________________________________________________________________
activation_76 (Activation)      (None, 24, 24, 64)   0           bn2[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_49 (ZeroPadding2 (None, 26, 26, 64)   0           activation_76[0][0]              
__________________________________________________________________________________________________
conv3 (Conv2D)                  (None, 24, 24, 192)  110784      zero_padding2d_49[0][0]          
__________________________________________________________________________________________________
bn3 (BatchNormalization)        (None, 24, 24, 192)  768         conv3[0][0]                      

__________________________________________________________________________________________________
activation_77 (Activation)      (None, 24, 24, 192)  0           bn3[0][0]                        
__________________________________________________________________________________________________
lrn_2 (Lambda)                  (None, 24, 24, 192)  0           activation_77[0][0]              
__________________________________________________________________________________________________
zero_padding2d_50 (ZeroPadding2 (None, 26, 26, 192)  0           lrn_2[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 12, 12, 192)  0           zero_padding2d_50[0][0]          
__________________________________________________________________________________________________
inception_3a_3x3_conv1 (Conv2D) (None, 12, 12, 96)   18528       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
inception_3a_5x5_conv1 (Conv2D) (None, 12, 12, 16)   3088        max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
inception_3a_3x3_bn1 (BatchNorm (None, 12, 12, 96)   384         inception_3a_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_3a_5x5_bn1 (BatchNorm (None, 12, 12, 16)   64          inception_3a_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_78 (Activation)      (None, 12, 12, 96)   0           inception_3a_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_80 (Activation)      (None, 12, 12, 16)   0           inception_3a_5x5_bn1[0][0]       
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 5, 5, 192)    0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
zero_padding2d_51 (ZeroPadding2 (None, 14, 14, 96)   0           activation_78[0][0]              
__________________________________________________________________________________________________
zero_padding2d_52 (ZeroPadding2 (None, 16, 16, 16)   0           activation_80[0][0]              
__________________________________________________________________________________________________
inception_3a_pool_conv (Conv2D) (None, 5, 5, 32)     6176        max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
inception_3a_3x3_conv2 (Conv2D) (None, 12, 12, 128)  110720      zero_padding2d_51[0][0]          
__________________________________________________________________________________________________
inception_3a_5x5_conv2 (Conv2D) (None, 12, 12, 32)   12832       zero_padding2d_52[0][0]          
__________________________________________________________________________________________________
inception_3a_pool_bn (BatchNorm (None, 5, 5, 32)     128         inception_3a_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_3a_1x1_conv (Conv2D)  (None, 12, 12, 64)   12352       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
inception_3a_3x3_bn2 (BatchNorm (None, 12, 12, 128)  512         inception_3a_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_3a_5x5_bn2 (BatchNorm (None, 12, 12, 32)   128         inception_3a_5x5_conv2[0][0]     
__________________________________________________________________________________________________
activation_82 (Activation)      (None, 5, 5, 32)     0           inception_3a_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_3a_1x1_bn (BatchNorma (None, 12, 12, 64)   256         inception_3a_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_79 (Activation)      (None, 12, 12, 128)  0           inception_3a_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_81 (Activation)      (None, 12, 12, 32)   0           inception_3a_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_53 (ZeroPadding2 (None, 12, 12, 32)   0           activation_82[0][0]              
__________________________________________________________________________________________________
activation_83 (Activation)      (None, 12, 12, 64)   0           inception_3a_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 12, 12, 256)  0           activation_79[0][0]              
                                                                 activation_81[0][0]              
                                                                 zero_padding2d_53[0][0]          
                                                                 activation_83[0][0]              
__________________________________________________________________________________________________
inception_3b_3x3_conv1 (Conv2D) (None, 12, 12, 96)   24672       concatenate_15[0][0]             
__________________________________________________________________________________________________
inception_3b_5x5_conv1 (Conv2D) (None, 12, 12, 32)   8224        concatenate_15[0][0]             
__________________________________________________________________________________________________
inception_3b_3x3_bn1 (BatchNorm (None, 12, 12, 96)   384         inception_3b_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_3b_5x5_bn1 (BatchNorm (None, 12, 12, 32)   128         inception_3b_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_84 (Activation)      (None, 12, 12, 96)   0           inception_3b_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_86 (Activation)      (None, 12, 12, 32)   0           inception_3b_5x5_bn1[0][0]       
__________________________________________________________________________________________________
average_pooling2d_9 (AveragePoo (None, 4, 4, 256)    0           concatenate_15[0][0]             
__________________________________________________________________________________________________
zero_padding2d_54 (ZeroPadding2 (None, 14, 14, 96)   0           activation_84[0][0]              
__________________________________________________________________________________________________
zero_padding2d_55 (ZeroPadding2 (None, 16, 16, 32)   0           activation_86[0][0]              
__________________________________________________________________________________________________
inception_3b_pool_conv (Conv2D) (None, 4, 4, 64)     16448       average_pooling2d_9[0][0]        
__________________________________________________________________________________________________
inception_3b_3x3_conv2 (Conv2D) (None, 12, 12, 128)  110720      zero_padding2d_54[0][0]          
__________________________________________________________________________________________________
inception_3b_5x5_conv2 (Conv2D) (None, 12, 12, 64)   51264       zero_padding2d_55[0][0]          
__________________________________________________________________________________________________
inception_3b_pool_bn (BatchNorm (None, 4, 4, 64)     256         inception_3b_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_3b_1x1_conv (Conv2D)  (None, 12, 12, 64)   16448       concatenate_15[0][0]             
__________________________________________________________________________________________________
inception_3b_3x3_bn2 (BatchNorm (None, 12, 12, 128)  512         inception_3b_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_3b_5x5_bn2 (BatchNorm (None, 12, 12, 64)   256         inception_3b_5x5_conv2[0][0]     
__________________________________________________________________________________________________
activation_88 (Activation)      (None, 4, 4, 64)     0           inception_3b_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_3b_1x1_bn (BatchNorma (None, 12, 12, 64)   256         inception_3b_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_85 (Activation)      (None, 12, 12, 128)  0           inception_3b_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_87 (Activation)      (None, 12, 12, 64)   0           inception_3b_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_56 (ZeroPadding2 (None, 12, 12, 64)   0           activation_88[0][0]              
__________________________________________________________________________________________________
activation_89 (Activation)      (None, 12, 12, 64)   0           inception_3b_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 12, 12, 320)  0           activation_85[0][0]              
                                                                 activation_87[0][0]              
                                                                 zero_padding2d_56[0][0]          
                                                                 activation_89[0][0]              
__________________________________________________________________________________________________
inception_3c_3x3_conv1 (Conv2D) (None, 12, 12, 128)  41088       concatenate_16[0][0]             
__________________________________________________________________________________________________
inception_3c_5x5_conv1 (Conv2D) (None, 12, 12, 32)   10272       concatenate_16[0][0]             
__________________________________________________________________________________________________
inception_3c_3x3_bn1 (BatchNorm (None, 12, 12, 128)  512         inception_3c_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_3c_5x5_bn1 (BatchNorm (None, 12, 12, 32)   128         inception_3c_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_90 (Activation)      (None, 12, 12, 128)  0           inception_3c_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_92 (Activation)      (None, 12, 12, 32)   0           inception_3c_5x5_bn1[0][0]       
__________________________________________________________________________________________________
zero_padding2d_57 (ZeroPadding2 (None, 14, 14, 128)  0           activation_90[0][0]              
__________________________________________________________________________________________________
zero_padding2d_58 (ZeroPadding2 (None, 16, 16, 32)   0           activation_92[0][0]              
__________________________________________________________________________________________________
inception_3c_3x3_conv2 (Conv2D) (None, 6, 6, 256)    295168      zero_padding2d_57[0][0]          
__________________________________________________________________________________________________
inception_3c_5x5_conv2 (Conv2D) (None, 6, 6, 64)     51264       zero_padding2d_58[0][0]          
__________________________________________________________________________________________________
inception_3c_3x3_bn2 (BatchNorm (None, 6, 6, 256)    1024        inception_3c_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_3c_5x5_bn2 (BatchNorm (None, 6, 6, 64)     256         inception_3c_5x5_conv2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 5, 5, 320)    0           concatenate_16[0][0]             
__________________________________________________________________________________________________
activation_91 (Activation)      (None, 6, 6, 256)    0           inception_3c_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_93 (Activation)      (None, 6, 6, 64)     0           inception_3c_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_59 (ZeroPadding2 (None, 6, 6, 320)    0           max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 6, 6, 640)    0           activation_91[0][0]              
                                                                 activation_93[0][0]              
                                                                 zero_padding2d_59[0][0]          
__________________________________________________________________________________________________
inception_4a_3x3_conv1 (Conv2D) (None, 6, 6, 96)     61536       concatenate_17[0][0]             
__________________________________________________________________________________________________
inception_4a_5x5_conv1 (Conv2D) (None, 6, 6, 32)     20512       concatenate_17[0][0]             
__________________________________________________________________________________________________
inception_4a_3x3_bn1 (BatchNorm (None, 6, 6, 96)     384         inception_4a_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_4a_5x5_bn1 (BatchNorm (None, 6, 6, 32)     128         inception_4a_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_94 (Activation)      (None, 6, 6, 96)     0           inception_4a_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_96 (Activation)      (None, 6, 6, 32)     0           inception_4a_5x5_bn1[0][0]       
__________________________________________________________________________________________________
average_pooling2d_10 (AveragePo (None, 2, 2, 640)    0           concatenate_17[0][0]             
__________________________________________________________________________________________________
zero_padding2d_60 (ZeroPadding2 (None, 8, 8, 96)     0           activation_94[0][0]              
__________________________________________________________________________________________________
zero_padding2d_61 (ZeroPadding2 (None, 10, 10, 32)   0           activation_96[0][0]              
__________________________________________________________________________________________________
inception_4a_pool_conv (Conv2D) (None, 2, 2, 128)    82048       average_pooling2d_10[0][0]       
__________________________________________________________________________________________________
inception_4a_3x3_conv2 (Conv2D) (None, 6, 6, 192)    166080      zero_padding2d_60[0][0]          
__________________________________________________________________________________________________
inception_4a_5x5_conv2 (Conv2D) (None, 6, 6, 64)     51264       zero_padding2d_61[0][0]          

__________________________________________________________________________________________________
inception_4a_pool_bn (BatchNorm (None, 2, 2, 128)    512         inception_4a_pool_conv[0][0]     

__________________________________________________________________________________________________
inception_4a_1x1_conv (Conv2D)  (None, 6, 6, 256)    164096      concatenate_17[0][0]             

__________________________________________________________________________________________________
inception_4a_3x3_bn2 (BatchNorm (None, 6, 6, 192)    768         inception_4a_3x3_conv2[0][0]     

__________________________________________________________________________________________________
inception_4a_5x5_bn2 (BatchNorm (None, 6, 6, 64)     256         inception_4a_5x5_conv2[0][0]     
__________________________________________________________________________________________________
activation_98 (Activation)      (None, 2, 2, 128)    0           inception_4a_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_4a_1x1_bn (BatchNorma (None, 6, 6, 256)    1024        inception_4a_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_95 (Activation)      (None, 6, 6, 192)    0           inception_4a_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_97 (Activation)      (None, 6, 6, 64)     0           inception_4a_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_62 (ZeroPadding2 (None, 6, 6, 128)    0           activation_98[0][0]              
__________________________________________________________________________________________________
activation_99 (Activation)      (None, 6, 6, 256)    0           inception_4a_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 6, 6, 640)    0           activation_95[0][0]              
                                                                 activation_97[0][0]              
                                                                 zero_padding2d_62[0][0]          
                                                                 activation_99[0][0]              
__________________________________________________________________________________________________
inception_4e_3x3_conv1 (Conv2D) (None, 6, 6, 160)    102560      concatenate_18[0][0]             
__________________________________________________________________________________________________
inception_4e_5x5_conv1 (Conv2D) (None, 6, 6, 64)     41024       concatenate_18[0][0]             
__________________________________________________________________________________________________
inception_4e_3x3_bn1 (BatchNorm (None, 6, 6, 160)    640         inception_4e_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_4e_5x5_bn1 (BatchNorm (None, 6, 6, 64)     256         inception_4e_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_100 (Activation)     (None, 6, 6, 160)    0           inception_4e_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_102 (Activation)     (None, 6, 6, 64)     0           inception_4e_5x5_bn1[0][0]       
__________________________________________________________________________________________________
zero_padding2d_63 (ZeroPadding2 (None, 8, 8, 160)    0           activation_100[0][0]             
__________________________________________________________________________________________________
zero_padding2d_64 (ZeroPadding2 (None, 10, 10, 64)   0           activation_102[0][0]             
__________________________________________________________________________________________________
inception_4e_3x3_conv2 (Conv2D) (None, 3, 3, 256)    368896      zero_padding2d_63[0][0]          
__________________________________________________________________________________________________
inception_4e_5x5_conv2 (Conv2D) (None, 3, 3, 128)    204928      zero_padding2d_64[0][0]          
__________________________________________________________________________________________________
inception_4e_3x3_bn2 (BatchNorm (None, 3, 3, 256)    1024        inception_4e_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_4e_5x5_bn2 (BatchNorm (None, 3, 3, 128)    512         inception_4e_5x5_conv2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 2, 2, 640)    0           concatenate_18[0][0]             
__________________________________________________________________________________________________
activation_101 (Activation)     (None, 3, 3, 256)    0           inception_4e_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_103 (Activation)     (None, 3, 3, 128)    0           inception_4e_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_65 (ZeroPadding2 (None, 3, 3, 640)    0           max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 3, 3, 1024)   0           activation_101[0][0]             
                                                                 activation_103[0][0]             
                                                                 zero_padding2d_65[0][0]          
__________________________________________________________________________________________________
inception_5a_3x3_conv1 (Conv2D) (None, 3, 3, 96)     98400       concatenate_19[0][0]             
__________________________________________________________________________________________________
inception_5a_3x3_bn1 (BatchNorm (None, 3, 3, 96)     384         inception_5a_3x3_conv1[0][0]     
__________________________________________________________________________________________________
activation_104 (Activation)     (None, 3, 3, 96)     0           inception_5a_3x3_bn1[0][0]       
__________________________________________________________________________________________________
average_pooling2d_11 (AveragePo (None, 1, 1, 1024)   0           concatenate_19[0][0]             
__________________________________________________________________________________________________
zero_padding2d_66 (ZeroPadding2 (None, 5, 5, 96)     0           activation_104[0][0]             
__________________________________________________________________________________________________
inception_5a_pool_conv (Conv2D) (None, 1, 1, 96)     98400       average_pooling2d_11[0][0]       
__________________________________________________________________________________________________
inception_5a_3x3_conv2 (Conv2D) (None, 3, 3, 384)    332160      zero_padding2d_66[0][0]          
__________________________________________________________________________________________________
inception_5a_pool_bn (BatchNorm (None, 1, 1, 96)     384         inception_5a_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_5a_1x1_conv (Conv2D)  (None, 3, 3, 256)    262400      concatenate_19[0][0]             
__________________________________________________________________________________________________
inception_5a_3x3_bn2 (BatchNorm (None, 3, 3, 384)    1536        inception_5a_3x3_conv2[0][0]     
__________________________________________________________________________________________________
activation_106 (Activation)     (None, 1, 1, 96)     0           inception_5a_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_5a_1x1_bn (BatchNorma (None, 3, 3, 256)    1024        inception_5a_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_105 (Activation)     (None, 3, 3, 384)    0           inception_5a_3x3_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_67 (ZeroPadding2 (None, 3, 3, 96)     0           activation_106[0][0]             
__________________________________________________________________________________________________
activation_107 (Activation)     (None, 3, 3, 256)    0           inception_5a_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 3, 3, 736)    0           activation_105[0][0]             
                                                                 zero_padding2d_67[0][0]          
                                                                 activation_107[0][0]             
__________________________________________________________________________________________________
inception_5b_3x3_conv1 (Conv2D) (None, 3, 3, 96)     70752       concatenate_20[0][0]             
__________________________________________________________________________________________________
inception_5b_3x3_bn1 (BatchNorm (None, 3, 3, 96)     384         inception_5b_3x3_conv1[0][0]     
__________________________________________________________________________________________________
activation_108 (Activation)     (None, 3, 3, 96)     0           inception_5b_3x3_bn1[0][0]       
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 1, 1, 736)    0           concatenate_20[0][0]             
__________________________________________________________________________________________________
zero_padding2d_68 (ZeroPadding2 (None, 5, 5, 96)     0           activation_108[0][0]             
__________________________________________________________________________________________________
inception_5b_pool_conv (Conv2D) (None, 1, 1, 96)     70752       max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
inception_5b_3x3_conv2 (Conv2D) (None, 3, 3, 384)    332160      zero_padding2d_68[0][0]          
__________________________________________________________________________________________________
inception_5b_pool_bn (BatchNorm (None, 1, 1, 96)     384         inception_5b_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_5b_1x1_conv (Conv2D)  (None, 3, 3, 256)    188672      concatenate_20[0][0]             
__________________________________________________________________________________________________
inception_5b_3x3_bn2 (BatchNorm (None, 3, 3, 384)    1536        inception_5b_3x3_conv2[0][0]     
__________________________________________________________________________________________________
activation_110 (Activation)     (None, 1, 1, 96)     0           inception_5b_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_5b_1x1_bn (BatchNorma (None, 3, 3, 256)    1024        inception_5b_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_109 (Activation)     (None, 3, 3, 384)    0           inception_5b_3x3_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_69 (ZeroPadding2 (None, 3, 3, 96)     0           activation_110[0][0]            
activation_111 (Activation)     (None, 3, 3, 256)    0           inception_5b_1x1_bn[0][0]        
concatenate_21 (Concatenate)    (None, 3, 3, 736)    0           activation_109[0][0]             
                                                                 zero_padding2d_69[0][0]          
                                                                 activation_111[0][0]             
average_pooling2d_12 (AveragePo (None, 1, 1, 736)    0           concatenate_21[0][0]             
flatten_3 (Flatten)             (None, 736)          0           average_pooling2d_12[0][0]       
dense_layer (Dense)             (None, 128)          94336       flatten_3[0][0]                  
norm_layer (Lambda)             (None, 128)          0           dense_layer[0][0]                

Total params: 3,752,688
Trainable params: 3,743,376
Non-trainable params: 9,312
